-- made by { @Mouamle } 
do 
ws = {} 
rs = {} 

-- some examples of how to use this :3 
ws[1] = "هلاو" 
rs[1] = "منوؤؤ9ؤؤور/ة 🌝🌹" 

ws[2] = "سلام عليكم" 
rs[2] = "عليكم سلام ورحمه الله وبركاته منوؤؤ9ؤؤور/ة 🌝🌹" 

ws[3] = "اسلام عليكم" 
rs[3] = "عليكم سلام ورحمه الله وبركاته منوؤؤ9ؤؤور/ة 🌝🌹" 

ws[4] = "السلام عليكم" 
rs[4] = "عليكم سلام ورحمه الله وبركاته منوؤؤ9ؤؤور/ة 🌝🌹" 

ws[5] = "سلام" 
rs[5] = "عليكم سلام ورحمه الله وبركاته منوؤؤ9ؤؤور/ة 🌝🌹" 

ws[6] = "صلام" 
rs[6] = "عليكم سلام ورحمه الله وبركاته منوؤؤ9ؤؤور/ة 🌝🌹" 

ws[7] = "شلونك" 
rs[7] = "تمام ورده وانته/ي 😇🌹" 

ws[8] = "اشلونك" 
rs[8] = "تمام ورده وانته/ي 😇🌹" 

ws[9] = "شلونج" 
rs[9] = "تمام ورده وانته/ي 😇🌹" 

ws[10] = "اشلونج" 
rs[10] = "تمام ورده وانته/ي 😇🌹" 

ws[11] = "تمام" 
rs[11] = "⌣{دِْۈۈۈۈ/يّارٌبْ_مـْو_يـّوّمٌ/ۈۈۈۈمْ}⌣ 😍" 

ws[12] = "ضوجه" 
rs[12] = "هاك فلوس 💵 حتى تفكك الضوجه 🤑🤑" 

ws[13] = "ضوجة" 
rs[13] = "هاك فلوس 💵 حتى تفكك الضوجه 🤑🤑" 

ws[14] = "زين" 
rs[14] = "دوؤؤؤمــــ😌🐾ــــــك/ج" 

ws[15] = "زينه" 
rs[15] = "دوؤؤؤمــــ😌🐾ــــــك/ج" 

ws[16] = "زينة" 
rs[16] = "دوؤؤؤمــــ😌🐾ــــــك/ج" 

ws[17] = "بخير" 
rs[17] = "😌🐾 ياااااااارب الى الأفضل" 

ws[18] = "منور" 
rs[18] = "نــؤؤؤ99ؤؤؤرك/ج  حرڰ وجهي 🌚😹" 

ws[19] = "منوره" 
rs[19] = "نــؤؤؤ99ؤؤؤرك/ج  حرڰ وجهي 🌚😹" 

ws[20] = "منورة" 
rs[20] = "نــؤؤؤ99ؤؤؤرك/ج  حرڰ وجهي 🌚😹" 

ws[21] = "شخباركم" 
rs[21] = "احنه تمام احجيلنه انته/ي شلوونك/ج 😌" 

ws[22] = "شلونكم" 
rs[22] = "احنه تمام احجيلنه انته/ي شلوونك/ج 😌" 

ws[23] = "اخباركم" 
rs[23] = "احنه تمام احجيلنه انته/ي شلوونك/ج 😌" 

ws[24] = "ابوك" 
rs[24] = "عـــ👴🏽ـوف/ي لحجي 🤑 بحــاله" 

ws[25] = "ابوج" 
rs[25] = "عـــ👴🏽ـوف/ي لحجي 🤑 بحــاله" 

ws[26] = "امك" 
rs[26] = "🤑 عــ👵🏻ــؤف الحجيه بحالها" 

ws[27] = "امج" 
rs[27] = "🤑 عــ👵🏻ــؤف الحجيه بحالها" 

ws[28] = "اختك" 
rs[28] = "😹☝🏿️حظرو سجاجينكم 🔪جابو سيره الخوات راح تصير عركه" 

ws[29] = "اختج" 
rs[29] = "😹☝🏿️حظرو سجاجينكم 🔪جابو سيره الخوات راح تصير عركه" 

ws[30] = "اخوك" 
rs[30] = "🌝😹 هووووه اني جيت للكروب داخلص منه شسوي/ن  بي  انته/ي" 

ws[31] = "اخوج" 
rs[31] = "🌝😹 هووووه اني جيت للكروب داخلص منه شسوي/ن  بي  انته/ي" 

ws[32] = "زاحف" 
rs[32] = "لتشوؤف الناس بعين طبعك 😹😍  \n #في_منتصف_الجبهة_تم_القصف 😂" 

ws[33] = "زاحفه" 
rs[33] = "ماخرب الشباب الطيبه غيرجن 😹 شنووو علاججن" 

ws[34] = "زاحفة" 
rs[34] = "ماخرب الشباب الطيبه غيرجن 😹 شنووو علاججن" 

ws[35] = "زباله" 
rs[35] = "لاتقلط 😤🔫 لو الا  ازرف بيتكم" 

ws[36] = "زبالة" 
rs[36] = "لاتقلط 😤🔫 لو الا  ازرف بيتكم" 

ws[37] = "انجب" 
rs[37] = "☹️☝🏿️ هــاااااي عليه مو" 

ws[38] = "انجبي" 
rs[38] = "☹️☝️ ️🏿️ هــاااااي عليها مو" 

ws[39] = "اهو" 
rs[39] = "😹 ليش ولك/ج خطيه هذا/ه 😿 لاتكول اهوو" 

ws[40] = "اهوو" 
rs[40] = "😹 ليش ولك/ج خطيه هذا/ه 😿 لاتكول اهوو" 

ws[41] = "اهووو" 
rs[41] = "😹 ليش ولك/ج خطيه هذا/ه 😿 لاتكول اهوو" 

ws[42] = "تخليني" 
rs[42] = "الُا َہِہِهَہهَہهَہهَہهَہِ فَـشِلُـتْكِ امٌـ🚶ـشِيَ لُـ😡ـكِ زُاحُــ🐍ـفَ😹✋" 

ws[43] = "ورده" 
rs[43] = "🙈الي يمريني بورده ارمي بورده هيه والمزهريه   #ياخي_الكرم_واجب 😹" 

ws[44] = "وردة" 
rs[44] = "🙈الي يمريني بورده ارمي بورده هيه والمزهريه   #ياخي_الكرم_واجب 😹" 

ws[45] = "سرسري" 
rs[45] = "شـــكـــ⚔ــو 😒🚬اشــرايــد/ه🙄👿" 

ws[46] = "فلوس" 
rs[46] = "كبدي شتريد/ين فلوسك/ج  كاش لو شيك 🤔 ؟" 

ws[47] = "كاش" 
rs[47] = "هوه اني لو عندي كاش اصير بوت 😹 الله وكيلك نص ملفاتي بلدين 😹😹" 

ws[48] = "شيك" 
rs[48] = "هوه اني لو عندي شيك  اصير بوت 😹 الله وكيلك نص ملفاتي بلدين 😹😹" 

ws[49] = "سياره" 
rs[49] = "😹☝🏿️ ت ريد/ين سياره هوه انته/ي بايسكل كل مترين تضرب دقله 😹" 

ws[50] = "سيارة" 
rs[50] = "😹☝🏿️ تريد/ين سياره هوه انته/ي بايسكل كل مترين تضرب دقله 😹" 

ws[51] = "موعد غرامي" 
rs[51] = "😍موعد غرامي اسف متواعد 😹❤️" 

ws[52] = "ملابس" 
rs[52] = "🌚☝🏿️ تريدهن من المول لو من باله ؟" 

ws[53] = "مول" 
rs[53] = "😹☝🏿️يريد يقطني ماشتريلك لوتموت" 

ws[54] = "باله" 
rs[54] = "😹☝🏿️ موحلوات عليك هم ماشتريلك" 

ws[55] = "بالة" 
rs[55] = "😹☝🏿️ موحلوات عليك هم ماشتريلك" 

ws[56] = "مكياج" 
rs[56] = "هيج انتي جكمه 😹😍 تردين مكياج  \n يوجد ☟تٌَحَـتْ☟ المكياج الخادع  \n (͡° ͜ʖ ͡°)  اما قمر ساطع \n او نوع من انواع الضفادع 😂🐸" 

ws[57] = "احبك" 
rs[57] = "اســـ💔ـف مرتبط ويه نص بنات الكروب 😂❤️  لمن وحده تطفر تعالي" 

ws[58] = "اعشقك" 
rs[58] = "عيــ🙈ــب استحـ😌ــي" 

ws[59] = "عشق" 
rs[59] = "يمه اذوبــن 😌❤️" 

ws[60] = "نعال" 
rs[60] = "🙁☝🏿️ياعزيزي ليش تجاوز 😹 اله اسحلك/ج" 

ws[61] = "احبنك" 
rs[61] = "😌❤️ طبعا وتموت/ين  عليه هم" 

ws[62] = "مرتي" 
rs[62] = "يعني عفت النسوان كلها جيت على مرتي 😡" 

ws[63] = "طليقي" 
rs[63] = "😹 طلكج لان تصرفين هواي فلوس" 

ws[64] = "طليقتي" 
rs[64] = "لتهتم 😌😍 ازوجك وحده احلى منها وماتصرف فلوس هواي" 

ws[65] = "اشاقه" 
rs[65] = "😹😍 استمر هوه غير شقاك/ج الثكيل يخبل" 

ws[66] = "اشاقة" 
rs[66] = "😹😍 استمر هوه غير شقاك/ج الثكيل يخبل" 

ws[67] = "هه" 
rs[67] = "اسم الله غصيت 😝 هاك اشرب 🍾🍷" 

ws[68] = "ههه" 
rs[68] = "😍🙈شنوو هاي الضحكه لتخبل" 

ws[69] = "هههه" 
rs[69] = "دوم الضحكات 😍🤘🏿" 

ws[70] = "اسمعي" 
rs[70] = "كوووووؤ👂🏿🌝👂🏿ؤؤؤؤؤل/ي سامعك/ج" 

ws[71] = "اسمع" 
rs[71] = "كوووووؤ👂🏿🌝👂🏿ؤؤؤؤؤل/ي سامعك/ج" 

ws[72] = "شوف" 
rs[72] = "👀ششوف 👀" 

ws[73] = "شسمك" 
rs[73] = "اسمه اللمبــي 😹❤️" 

ws[74] = "شسمج" 
rs[74] = "اسمها جعجوعه" 

ws[75] = "شسمها" 
rs[75] = "لو اعرف اسمها جان مابقيت يمك/ج 😹" 

ws[76] = "شسمه" 
rs[76] = "لو اعرف اسمه جان مابقيت يمك/ج 😹" 

ws[77] = "هلو" 
rs[77] = "منوؤؤ9ؤؤور/ة 🌝🌹" 

ws[78] = "مرحبا" 
rs[78] = "مراحب منوؤؤ9ؤؤور/ة 🌝🌹" 

ws[79] = "مرحبه" 
rs[79] = "منوؤؤ9ؤؤور/ة 🌝🌹" 

ws[80] = "مرحبة" 
rs[80] = "منوؤؤ9ؤؤور/ة 🌝🌹" 

ws[81] = "خاص" 
rs[81] = "شسوون بلخاص 😳😹 يي عمي شتغل الخاص" 

ws[82] = "خاصك" 
rs[82] = "شسوون بلخاص 😳😹 يي عمي شتغل الخاص" 

ws[83] = "خاصج" 
rs[83] = "شسوون بلخاص 😳😹 يي عمي شتغل الخاص" 

ws[84] = "غنيلي" 
rs[84] = "شتحب تسمع (راب_حزين_شعر_ردح_ردح حزين _ موال_ موسيقى ) \n كيفك انته وذوقك 😌❤️" 

ws[85] = "راب" 
rs[85] = "شكولك مال ثريد لاتخربها بلراب 😹❤️" 

ws[86] = "حزين" 
rs[86] = "اكو هواي مجروحين 😔 خاف غني وذكرهم" 

ws[87] = "ردح" 
rs[87] = "😹😹😹تره رمضان قريب صلي صوم احسلك" 

ws[88] = "ردح حزين" 
rs[88] = "😹😹 مشت عليكم وين اكو ردح حزين عود هاي انته الجبير 🤑😹" 

ws[89] = "موال" 
rs[89] = "🙁☝🏿️شكولي مال تحشيش ماخربها بلموال 😹❤️" 

ws[90] = "موسيقى" 
rs[90] = "😒☝🏿️اكعد راحه بيتهوفن 😹 \n #اذا_ماتعرف_منو_بيتهوفن  \n #اكتب منو بيتهوفن" 

ws[91] = "منو بيتهوفن" 
rs[91] = "😹😹😹 شوف ياربي يطلب من الحافي نعال" 

ws[92] = "صباح الخير" 
rs[92] = "صباحووو اشرقت وانورت 😌🍁" 

ws[93] = "صباحو" 
rs[93] = "صباحو اشرقت وانورت 😌🍁" 

ws[94] = "صباحوو" 
rs[94] = "صباحووو اشرقت وانورت 😌🍁" 

ws[95] = "مساء الخير" 
rs[95] = "مساء الخيرات اشرقت وانورت 😌🍁" 

ws[96] = "مسائو" 
rs[96] = "مسائو اشرقت وانورت 😌🍁" 

ws[97] = "عركه" 
rs[97] = "🙀يا الهي \n عركه اجيب 🏃🏻 السجاجين 🔪والمسدسات 🔫" 

ws[98] = "عركة" 
rs[98] = "🙀يا الهي \n عركه اجيب 🏃🏻 السجاجين 🔪والمسدسات 🔫" 

ws[99] = "ممكن" 
rs[99] = "كضوووو راح يزحف 🙀😹" 

ws[100] = "تحبني" 
rs[100] = "اشلون ماحبك/ج اذا انته/ي العشق مالي" 

ws[101] = "تعشقني" 
rs[101] = "😌☝🏿️اعشقكج لدرجه اذا خلوج بين 10 وردات اطلعج واني مغمض لان بس انتي الشوكه 😹\n #طــــن_تم_القصف" 

ws[102] = "بوسني" 
rs[102] = "امــــ💋💋ــــــوااااح" 

ws[103] = "بوسه جبيره" 
rs[103]= "امــــ💋💋ــــمـــ💋💋ــــمــــــ💋💋ــــمــــــــــــــــ💋💋ــــمــؤوووووواح 😹\n بهاي البوسه انسف وجهك/ج 😹😹" 

ws[104] = "دوم" 
rs[104] = "⌣{يـّـٌدِْۈۈ/عّزٌگ-ۈنَرﮔﺺّ بعرسك/ۈۈمْ}⌣" 

ws[105] = "باي" 
rs[105] = "😹☝🏿️ بايات مال درج" 

ws[106] = "جاو🚶🏻" 
rs[106] = "خليك مضوجني 😹❤️" 

ws[107] = "جاو" 
rs[107] = "خليك مضوجني 😹❤️" 

ws[108] = "بيباي" 
rs[108] = "وين بعد وكت 🙊❤️" 

ws[109] = "حبيبي" 
rs[109] = "😹☝🏿️ جذااااااااااااااااب موحبيبك" 

ws[110] = "ضلعي" 
rs[110] = "😒☝🏿️مــاعندي ضلوع اني بوت" 

ws[111] = "ضلعتي" 
rs[111] = "هلا هلا اجن الضلوعات 😍😹" 

ws[112] = "غبي" 
rs[112] = "انته الاغبه 😹😹😹" 

ws[113] = "تسلم" 
rs[113] = "سالم راسك/ج😌❤️" 

ws[114] = "تسلمين" 
rs[114] = "سالم راسك/ج😌❤️" 

ws[115] = "😀" 
rs[115] = "عيوووون مال كوري 😹😹" 

ws[116] = "😬" 
rs[116] = "ضم سنونك/ج فضحتنه 🙀😹" 

ws[117] = "😂" 
rs[117] = "دوم الضحكات عيوني 😍" 

ws[118] = "😂😂" 
rs[118] = "دوم الضحكات عيوني 😍" 

ws[119] = "😂😂😂" 
rs[119] = "دوم الضحكات عيوني 😍" 

ws[120] = "😹" 
rs[120] = "دوم الضحكات عيوني 😍" 

ws[121] = "😹😹" 
rs[121] = "دوم الضحكات عيوني 😍" 

ws[122] = "😃" 
rs[122] = "فرحان/ه دووووم الفرحه ☺️😍" 

ws[123] = "😅" 
rs[123] = "شبيك جنك واحد دايضربو ابره 😂" 

ws[124] = "😇" 
rs[124] = "شيخ جامع" 

ws[125] = "😉" 
rs[125] = "لتتحــارش/ين" 

ws[126] = "😊" 
rs[126] = "انها احقر ابتسامه على وجه الكره الارضيه 😹" 

ws[127] = "🙂" 
rs[127] = "ابتسامه مال واحد مكتول كتله غسل ولبس 😍😹" 

ws[128] = "🙃" 
rs[128] = "وجهة مكلوب أإأذأإأ هوه جميل 😌😍" 

ws[129] = "☺️" 
rs[129] = "خجلان الحلو/ة 😂 منو تحارش بيك/ج غيري 😌" 

ws[130] = "😋" 
rs[130] = "جووووعان 😃" 

ws[131] = "😌" 
rs[131] = "تواضع شويه 😒🔭" 

ws[132] = "😍" 
rs[132] = "عيونه حمر عشكان/ة  الحلو/ة 😍😹" 

ws[133] = "😘" 
rs[133] = "ممنوع التقبيل في هذا الكروب 😹 هسه \nيزعلون الحدايق" 

ws[134] = "😗" 
rs[134] = "بوووووسه مال عجوز 😝😂" 

ws[135] = "😚" 
rs[135] = "عساس مستحي/ة بعد بست 😹" 

ws[136] = "😜" 
rs[136] = "ضم لسانك 😁 فضحتنه" 

ws[137] = "😝" 
rs[137] = "غص الولد جيبوله ببسي دايت 😹" 

ws[138] = "😛" 
rs[138] = "هذا مطلع لسانه كيوت 😹" 

ws[139] = "😐" 
rs[139] = "عجوز في صدمه 😹☝🏿️" 

ws[140] = "🤐" 
rs[140] = "عفيه لو هيج تخيط حلكك لو لا 😹😹" 

ws[141] = "حاته" 
rs[141] = "وينها خلي نرقمها 😍😹" 

ws[142] = "حاتة" 
rs[142] = "وينها خلي نرقمها 😍😹" 

ws[143] = "صاك" 
rs[143] = "وينه خلي اشمر عليه طماطه 😹😍" 

ws[144] = "صاكة" 
rs[144] = "وينها خلي اكفش شعرها 😹😍" 

ws[145] = "حات" 
rs[145] = "😒وين اكو هيج مصطلح" 

ws[146] = "سرسر" 
rs[146] = " ها لوكي😠اشرايد اشكد لوكي هذا😅بطلو زحف كدام البنات نافخ روحه 😴وهوه جنه طلي ياله ولي 😅😆" 

ws[147] = "🤔🤔" 
rs[147] = "على كيفك انشتاين 😹🤘🏿" 

ws[148] = "☹️" 
rs[148] = "لاتحزن 🙁❤️ ف الله معك" 

ws[149] = "بوت" 
rs[149] = "شكو خير شرايد.بابا اريد اكل هسة ولي عني يلا" 

ws[150] = "الصاعقة" 
rs[150] = " آقۆئ ۆآفَضلُ سۆرٍس📡شُڪرٍآ لُِآخـتيآرٍڪ💎th3_stun👍🏿 " 

ws[151] = "سورس" 
rs[151] = "الصاعقة⚡th3_stun" 

ws[152] = "منو هاي" 
rs[152] = "هَـ (⊙﹏⊙) ــاآي😝الراقصه مال الكروب💃😂" 

ws[153] = "اتفل" 
rs[153] = "‏​‏​​​​​​‏​تـ💦😙ـف ‏​تِـٌ😙💦💦ـفين ‏​ثلاث تـ😗💦💦💦ـ فات‏​​​​ ‏​تف😙ــٌّوُفه ذغِيرَونهٌ ٌ 🌚💦 💦💦💦🌪💨💨💧💦🌊💦💦💦💦🌊💦💦🌊💦💦 اسـ.ــ..ــــــــحب اقسام خخخخخ تفوووو 💦💦💦💦💦💦💦💦💦💦💦💦💦💦💦🌊🌊💦💦🌊🌪💨💨🌪🌪🌊💦💧💦 خـٌٌـٌٌلُـِـِِ😁ــِِـِـُصُ عتاد😹🖐" 

ws[154] = "خالتك" 
rs[154] = "هَـ (⊙﹏⊙) ــاآك😝افلوس💵جيبلي خالتك😂" 

ws[155] = "حمه" 
rs[155] = "ۿہ✯ہذآإ✟😘❥الבـ﴿❤️﴾ـلـٰ୭وٰ୭❥😍مالي فديته😂" 

ws[156] = "يا سورس هذا" 
rs[156] = " ☠⚡️th3_stun⚡️الصاعقة☠ " 

 ws[157] = "😏" 
rs[157] = "اشبيك😒عاوج حلكك😒عبالك واحد 😂ريحك من😒الحلبجه😹" 

-- the main function 
function run( msg, matches ) 
 -- just a local variables that i used in my algorithm 
 local i = 0; local w = false 

 -- the main part that get the message that the user send and check if it equals to one of the words in the ws table :) 
 -- this section loops through all the words table and assign { k } to the word index and { v } to the word itself 
 for k,v in pairs(ws) do 
  -- change the message text to uppercase and the { v } value that toke form the { ws } table and than compare it in a specific pattern 
  if ( string.find(string.upper(msg.text), "^" .. string.upper(v) .. "$") ) then 
   -- assign the { i } to the index of the reply and the { w } to true ( we will use it later ) 
   i = k; w = true; 
  end 
 end 

 -- check if { w } is not false and { i } not equals to 0 
 if ( (w ~= false) and (i ~= 0) ) then 
  -- get the receiver :3 
  R = get_receiver(msg) 
  -- send him the proper message from the index that { i } assigned to 
  --send_large_msg ( R , rs[i] ); 
  --send_reply(msg.id, rs[i]) 
  reply_msg(msg.id, rs[i], ok_cb, false ) 
 end 
 -- don't edit this section 
 if ( msg.text == "about" ) then 
  if ( msg.from.username == "Mouamle" ) then 
   R = get_receiver(msg) 
   send_large_msg ( R , "Made by @Mouamle" ); 
  end 
 end 

end 

return { 
 patterns = { 
  "(.*)" 
   }, 
   run = run 
} 

end 
