do 

function run(msg, matches) 
  return [[ 
📜🚶🏻ITACHI BOT V1 🚶🏻
➖🔵➖🔵➖🔵➖
م1┊لعرض الاوامر الرئيسيه
م2┊لعرض الاوامر الثانويه
م3┊لعرض اوامر حماية المجموعه
م4┊لعرض الاوامر الاضافيه
م5┊اوامر اضافه للمجموعه
م المطور┊لعرض اوامر الخاصه في المطور
➖🔵➖🔵➖🔵➖🔵➖🔵➖🔵➖
📛┊للتحدث مع مطور البوت 👇🏿
@lll56
⛔️┊واذا جنت محظور تواصل عبر بوت التواصل 👇🏿
@itachitwsl_bot
✳️┊القناة الخاصه في البوت 👇🏿
ِ@ITACHIBOT1
]] 

end 

return { 
description = "Help list", 
usage = "Help list", 
patterns = { 
"^(الاوامر)$", 
}, 
run = run 
} 
end 
