--[[ 

]] 

do 

local function run(msg, matches) 
if is_momod(msg) and matches[1]== "م2" then 
return [[ 

اوامر المجوعة العامة كبد عمري 🗼 
ـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَ 

💎ضع اسم + الاسم 🔥 
💎ضع صورة 🔥 
💎ضع قوانين 🔥 
💎ضع وصف 🔥 
💎ضع معرف 🔥 
💎ضع الرابط 🔥 
💎ضع التكرار [5-20] 🔥 
ـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَـَـَــَ 
للمسح اكتب 📵 
💎مسح+ (القوانين+الوصف+الادمنية….  ) 🔥 
💎القوانين=لعوض القوانين 🔥 
💎معلوماتي=معلوماتك 🔥 
💎موقعي _ موقعك 🔥 
💎اشارة للكل + كلمة=لعمل تاك للكل 🔥 
💎اعدادات الوسائط = 🔥 
💎اعدادات المجموعة = 🔥 
💎 حذف+رقم = حذف الرسائل 🔥 
➖🔵➖🔵➖🔵➖🔵➖🔵➖🔵➖
📛┊للتحدث مع مطور البوت 👇🏿
@lll56
⛔️┊واذا جنت محظور تواصل عبر بوت التواصل 👇🏿
@itachitwsl_bot
✳️┊القناة الخاصه في البوت 👇🏿
ِ@ITACHIBOT1
]] 
end 

if not is_momod(msg) then 
return "ليش تلعب بكيفك😡للمدرائ فقط انته عضو لاتلعب⚡️ 😐⛔️" 
end 

end 
return { 
description = "Help list", 
usage = "Help list", 
patterns = { 
"(م2)" 
}, 
run = run 
} 
end
