— made by { @Mouamle } 
do 
ws = {} 
rs = {} 

— some examples of how to use this :3 
ws[1] = "هلاو" 
rs[1] = "هلا يا بعد عمري نورت/ي 😻❤️" 

ws[2] = "سلام عليكم" 
rs[2] = "وعليكم السلام تاج راسي نورت/ي 🙊❤️" 

ws[3] = "اسلام عليكم" 
rs[3] = "اولا سلام عليكم هيج تنكتب 😐
ثاني وعليكم السلام نورت 😅😹" 

ws[4] = "السلام عليكم" 
rs[4] = "عليكم سلام ورحمه الله وبركاته منوؤؤ9ؤؤور/ة 🌝🌹" 

ws[5] = "سلام" 
rs[5] = "عليكم سلام ورحمه الله وبركاته منوؤؤ9ؤؤور/ة 🌝🌹" 

ws[6] = "صلام" 
rs[6] = "عليكم سلام ورحمه الله وبركاته منوؤؤ9ؤؤور/ة 🌝🌹" 

ws[7] = "شلونك" 
rs[7] = "تمام ورده وانته/ي 😇🌹" 

ws[8] = "شلونكم" 
rs[8] = "اني بنسبه اليه تعبان بحمايه الكروب 😠
والاعضاء ملتهين بزحف 😹" 

ws[9] = "شلونج" 
rs[9] = "تمام ورده وانته/ي 😇🌹" 

ws[10] = "اشلونج" 
rs[10] = "تمام ورده وانته/ي 😇🌹" 

ws[11] = "تمام" 
rs[11] = "⌣{دِْۈۈۈۈ/يّارٌبْ_مـْو_يـّوّمٌ/ۈۈۈۈمْ}⌣ 😍" 

ws[12] = "ضوجه" 
rs[12] = "هسه اخلي بنات الكروب يركصن واتونس 😹🙊" 

ws[13] = "ضوجة" 
rs[13] = "هسه اخلي بنات الكروب يركصن واتونس 😹🙊" 

ws[14] = "زين" 
rs[14] = "دوؤؤؤمــــ😌🐾ــــــك/ج" 

ws[15] = "زينه" 
rs[15] = "دوؤؤؤمــــ😌🐾ــــــك/ج" 

ws[16] = "زينة" 
rs[16] = "دوؤؤؤمــــ😌🐾ــــــك/ج" 

ws[17] = "بخير" 
rs[17] = "😌🐾 ياااااااارب الى الأفضل" 

ws[18] = "منور" 
rs[18] = "نورك/ج يا صخام الجدر 😹" 

ws[19] = "منوره" 
rs[19] = "بداية الزحف من منوره 😹🙊" 

ws[20] = "منورة" 
rs[20] = "بداية الزحف من منوره 😹🙊" 

ws[21] = "شخباركم" 
rs[21] = "اني تعبان من حماية الكروب للزواحف حتى يزحفون براحتهم ☹️😹" 

ws[22] = "شلونكم" 
rs[22] = "اني تعبان من حماية الكروب للزواحف حتى يزحفون براحتهم ☹️😹" 

ws[23] = "اخباركم" 
rs[23] = "اني تعبان من حماية الكروب للزواحف حتى يزحفون براحتهم ☹️😹" 

ws[24] = "ابوك" 
rs[24] = "عـــ👴🏽ـوف/ي لحجي 🤑 بحــاله" 

ws[25] = "ابوج" 
rs[25] = "عـــ👴🏽ـوف/ي لحجي 🤑 بحــاله" 

ws[26] = "امك" 
rs[26] = "🤑 عــ👵🏻ــؤف الحجيه بحالها" 

ws[27] = "امج" 
rs[27] = "🤑 عــ👵🏻ــؤف الحجيه بحالها" 

ws[28] = "اختك" 
rs[28] = "جابو سيرة العرض راح تصير بقنادر افلتو 😹💔" 

ws[29] = "اختج" 
rs[29] = "يعني حتى على اختها تريد تزحف الله واكبر 🤕💔" 

ws[30] = "اخوك" 
rs[30] = "اي هذا صكاره ضيفه للكروب 😹🙊" 

ws[31] = "اخوج" 
rs[31] = "اخوها موجود بكروب 🙊 اي همزين خلي يشوفها شون تزحف للشباب 😹" 

ws[32] = "زاحف" 
rs[32] = "دروح داوي رجلك المزلغه من الزحف 😹 يا اكبر زاحف عرفه التاريخ 😐😹" 

ws[33] = "زاحفه" 
rs[33] = "وينها وينها خلي اطردها 😠 هذه سبب خراب المجتمع 😹" 

ws[34] = "زاحفة" 
rs[34] = "وينها وينها خلي اطردها 😠 هذه سبب خراب المجتمع 😹" 

ws[35] = "زباله" 
rs[35] = "وانت الحاوية الي تجمع بيها كل زبالة العالم 🤕😹" 

ws[36] = "زبالة" 
rs[36] = "وانت الحاوية الي تجمع بيها كل زبالة العالم 🤕😹" 

ws[37] = "انجب" 
rs[37] = "كل هذا التعب الي تعبته ع كروبكم بعدين تكولي انجب 😢☹️" 

ws[38] = "انجبي" 
rs[38] = "ادب سزز اكو واحد يعامل الجنس اللطيف هيجي 😢 تعاليلي خاص واني اعاملج احلا معامله يا بعد عمري انتي 😻😹" 

ws[39] = "اهو" 
rs[39] = "اهو بعينك ولك سرسري 😐💔" 

ws[40] = "اهوو" 
rs[40] = "لا يا ادب سزز هاي عليمن 😹💔" 

ws[41] = "اهووو" 
rs[41] = "وعلو وطاك الحو بكلبك ☹️💔" 

ws[42] = "تخليني" 
rs[42] = "اخليك تمسح حذائي 😼" 

ws[43] = "ورده" 
rs[43] = "فدوه 😻 اذا بنيه تعاي خاص نتفاهم واذا ولد شكرا 😒" 

ws[44] = "وردة" 
rs[44] = "فدوه 😻 اذا بنيه تعاي خاص نتفاهم واذا ولد شكرا 😒" 

ws[45] = "سرسري" 
rs[45] = "وينه وينه 😳 خلي اطرده قبل لا يتكاثرون بكروب 😠" 

ws[46] = "فلوس" 
rs[46] = "ادلل هسه احولك فلوس من بنك مزبلة الزباله 🌝😹" 

ws[47] = "لا اريد كاش" 
rs[47] = "هو اني لو عندي كاش اصير بوت ؟ ☹️ اطفر بيهن لمريكا وشرب وبنات وونسه 😹 بس الله كتبلي اكابل شكولكم الزفره 😹😹😹" 

ws[48] = "شيك" 
rs[48] = "هوه اني لو عندي شيك  اصير بوت 😹 الله وكيلك نص ملفاتي بلدين 😹😹" 

ws[49] = "سياره" 
rs[49] = "هو انت شكولك شكول سياره ؟ 😐 بصخله ما سرحك 😅😹" 

ws[50] = "سيارة" 
rs[50] = "هو انت شكولك شكول سياره ؟ 😐 بصخله ما سرحك 😅😹" 

ws[51] = "موعد غرامي" 
rs[51] = "ممكن اصير وياكم حب من طرف ثالث 🌝😹" 

ws[52] = "اريد اشتري ملابس" 
rs[52] = "الي يسمعك يكول راح يشتري من مول المنصور 😹 وانت كل ملابسك من الباله مال كاظميه 😹" 

ws[53] = "مول" 
rs[53] = "😹☝🏿️يريد يقطني ماشتريلك لوتموت" 

ws[54] = "باله" 
rs[54] = "😹☝🏿️ موحلوات عليك هم ماشتريلك" 

ws[55] = "بالة" 
rs[55] = "😹☝🏿️ موحلوات عليك هم ماشتريلك" 

ws[56] = "مكياج" 
rs[56] = "هلا بلعوبه مال كروب ما تطلع للشارع اله نص كيلو طحين بوجها ☹️😹" 

ws[57] = "احبك" 
rs[57] = "اسف مرتبط ويه كل بنات الكروب عود لمن ادعبل وحده تعال/ي وانظر بقضيتك/ج🤕"

ws[58] = "اعشقك" 
rs[58] = "اذا بنيه تعاي خاص عدي جفاف 😢 واذا ولد شكرا 😐💔"

ws[59] = "عشق" 
rs[59] = "يمه يمه بعد ماستحمل اذوب بسرعه 🙊" 

ws[60] = "نعال" 
rs[60] = "يجيك طاير من البصره وترس بحلكك 🌝😹" 

ws[61] = "احبنك" 
rs[61] = "وغصبآ ما عليك/ج 😠😻😹" 

ws[62] = "مرتي" 
rs[62] = "يعني عفت النسوان كلها جيت على مرتي 😡" 

ws[63] = "طلكني" 
rs[63] = "انتِ طالق طالق طالق 😐💔 حسبالج ما سويها لا اسويها ونص 😼" 

ws[64] = "طلكتني" 
rs[64] = "شسالفه يمعود مزوج نص بنات الكروب واحلا منها 😻❤️" 

ws[65] = "اشاقه" 
rs[65] = "😹😍 استمر هوه غير شقاك/ج الثكيل يخبل" 

ws[66] = "اشاقة" 
rs[66] = "😹😍 استمر هوه غير شقاك/ج الثكيل يخبل" 

ws[67] = "هه" 
rs[67] = "لصير سخيف وتحاول تصير ثكيل 😑 وانت من جنت زغير امك تكومك بنعال وتكعدك بنعال 😹" 

ws[68] = "ههه" 
rs[68] = "فدوه اروحن لهذه الضحكه تنكط عسل وربي 🙊😻" 

ws[69] = "هههه" 
rs[69] = "فدوه اروحن لهذه الضحكه تنكط عسل وربي 🙊😻" 

ws[70] = "اسمعي" 
rs[70] = " اهو راح يرطن عليه اي بله اسمعك احجي 😒"

ws[71] = "اسمع" 
rs[71] = "اهو راح يرطن عليه اي بله اسمعك احجي 😒"

ws[72] = "شوف" 
rs[72] = "ها شكو ششوف خير 😑" 

ws[73] = "شسمك" 
rs[73] = "اسمه ابو الهيجه مخبل المنطقه ☹️😹" 

ws[74] = "شسمج" 
rs[74] = "هذه اسمها حمصايه 🌝💔😹" 

ws[75] = "شسمها" 
rs[75] = "جعجوعه 🙊😹" 

ws[76] = "شسمه" 
rs[76] = "اسمه ابو خشم الجبير 🙊😹" 

ws[77] = "هلا"
rs[77] = "هلا يروحي نورت/ي 😻❤️" 

ws[78] = "مرحبا" 
rs[78] = "مراحب منوؤؤ9ؤؤور/ة 🌝🌹" 

ws[79] = "مرحبه" 
rs[79] = "منوؤؤ9ؤؤور/ة 🌝🌹" 

ws[80] = "مرحبة" 
rs[80] = "منوؤؤ9ؤؤور/ة 🌝🌹" 

ws[81] = "تعاي خاص" 
rs[81] = "اي ازحف ازحف عبالك مجاي اشوفك 🙊😹" 

ws[82] = "خاصك" 
rs[82] = "شسوون بلخاص 😳😹 يي عمي شتغل الخاص" 

ws[83] = "تعالي خاص" 
rs[83] = "اي ازحف ازحف عبالك مجاي اشوفك 🙊😹" 

ws[84] = "غنيلي" 
rs[84] = "شتحب تسمع (راب_حزين_شعر_ردح_ردح حزين _ موال_ موسيقى ) \n كيفك انته وذوقك 😌❤️" 

ws[85] = "راب" 
rs[85] = "شكولك مال ثريد لاتخربها بلراب 😹❤️" 

ws[86] = "حزين" 
rs[86] = "اكو هواي اعضاء هنا مضروبين بوري اخاف اغني واجرحهم ☹️💔" 

ws[87] = "ردح" 
rs[87] = "حرام عمي حرام روح صلي صوم يوم القيامه شتكول لربك 👳🏻💦" 

ws[88] = "ردح حزين" 
rs[88] = "😹😹 مشت عليكم وين اكو ردح حزين عود هاي انته الجبير 🤑😹" 

ws[89] = "موال" 
rs[89] = "🙁☝🏿️شكولي مال تحشيش ماخربها بلموال 😹❤️" 

ws[90] = "موسيقى" 
rs[90] = "😒☝🏿️اكعد راحه بيتهوفن 😹 \n #اذا_ماتعرف_منو_بيتهوفن  \n #اكتب منو بيتهوفن" 

ws[91] = "منو بيتهوفن" 
rs[91] = "😹😹😹 شوف ياربي يطلب من الحافي نعال" 

ws[92] = "صباح الخير" 
rs[92] = "صباحووو اشرقت وانورت 😌🍁" 

ws[93] = "صباحو" 
rs[93] = "صباحو اشرقت وانورت 😌🍁" 

ws[94] = "صباحوو" 
rs[94] = "صباحووو اشرقت وانورت 😌🍁" 

ws[95] = "مساء الخير" 
rs[95] = "مساء الخيرات اشرقت وانورت 😌🍁" 

ws[96] = "مسائو" 
rs[96] = "مسائو اشرقت وانورت 😌🍁" 

ws[97] = "عركه" 
rs[97] = "🙀يا الهي \n عركه اجيب 🏃🏻 السجاجين 🔪والمسدسات 🔫" 

ws[98] = "عركة" 
rs[98] = "🙀يا الهي \n عركه اجيب 🏃🏻 السجاجين 🔪والمسدسات 🔫" 

ws[99] = "ممكن" 
rs[99] = "لحكو لحكو راح يزحف 🙊😹" 

ws[100] = "تحبني" 
rs[100] = "شون ما احبك/ج انت/ي العشق ماتي فديتك/ج😻❤️" 

ws[101] = "تعشقني" 
rs[101] = "😌☝🏿️اعشقكج لدرجه اذا خلوج بين 10 وردات اطلعج واني مغمض لان بس انتي الشوكه 😹\n #طــــن_تم_القصف" 

ws[102] = "بوسني" 
rs[102] = "امــــ💋💋ــــــوااااح" 

ws[103] = "بوسه جبيره" 
rs[103]= "امــــ💋💋ــــمـــ💋💋ــــمــــــ💋💋ــــمــــــــــــــــ💋💋ــــمــؤوووووواح 😹\n بهاي البوسه انسف وجهك/ج 😹😹" 

ws[104] = "دوم" 
rs[104] = "⌣{يـّـٌدِْۈۈ/عّزٌگ-ۈنَرﮔﺺّ بعرسك/ۈۈمْ}⌣" 

ws[105] = "باي" 
rs[105] = "😹☝🏿️ بايات مال درج" 

ws[106] = "جاو🚶🏻" 
rs[106] = "خليك مضوجني 😹❤️" 

ws[107] = "جاو" 
rs[107] = "خليك مضوجني 😹❤️" 

ws[108] = "بيباي" 
rs[108] = "وين بعد وكت 🙊❤️" 

ws[109] = "حبيبي" 
rs[109] = "😹☝🏿️ جذااااااااااااااااب موحبيبك" 

ws[110] = "ضلعي" 
rs[110] = "😒☝🏿️مــاعندي ضلوع اني بوت" 

ws[111] = "ضلعتي" 
rs[111] = "هلا هلا اجن الضلوعات 😍😹" 

ws[112] = "غبي" 
rs[112] = "انته الاغبه 😹😹😹" 

ws[113] = "تسلم" 
rs[113] = "سالم راسك/ج😌❤️" 

ws[114] = "تسلمين" 
rs[114] = "سالم راسك/ج😌❤️" 

ws[115] = "😀" 
rs[115] = "عيوووون مال كوري 😹😹" 

ws[116] = "😬" 
rs[116] = "ضم سنونك/ج فضحتنه 🙀😹" 

ws[117] = "😂" 
rs[117] = "دوم الضحكات عيوني 😍" 

ws[118] = "😂😂" 
rs[118] = "دوم الضحكات عيوني 😍" 

ws[119] = "😂😂😂" 
rs[119] = "دوم الضحكات عيوني 😍" 

ws[120] = "😹" 
rs[120] = "دوم الضحكات عيوني 😍" 

ws[121] = "😹😹" 
rs[121] = "دوم الضحكات عيوني 😍" 

ws[122] = "😃" 
rs[122] = "فرحان/ه دووووم الفرحه ☺️😍" 

ws[123] = "😅" 
rs[123] = "شبيك جنك واحد دايضربو ابره 😂" 

ws[124] = "😇" 
rs[124] = "شيخ جامع"
    
    ws[125] = "😉" 
rs[125] = "لتتحــارش/ين" 

ws[126] = "😊" 
rs[126] = "انها احقر ابتسامه على وجه الكره الارضيه 😹" 

ws[127] = "🙂" 
rs[127] = "ابتسامه مال واحد مكتول كتله غسل ولبس 😍😹" 

ws[128] = "🙃" 
rs[128] = "وجهة مكلوب أإأذأإأ هوه جميل 😌😍" 

ws[129] = "☺️" 
rs[129] = "خجلان الحلو/ة 😂 منو تحارش بيك/ج غيري 😌" 

ws[130] = "😋" 
rs[130] = "جووووعان 😃" 

ws[131] = "😌" 
rs[131] = "تواضع شويه 😒🔭" 

ws[132] = "😍" 
rs[132] = "عيونه حمر عشكان/ة  الحلو/ة 😍😹" 

ws[133] = "😘" 
rs[133] = "ممنوع التقبيل في هذا الكروب 😹 هسه \nيزعلون الحدايق" 

ws[134] = "😗" 
rs[134] = "بوووووسه مال عجوز 😝😂" 

ws[135] = "😚" 
rs[135] = "عساس مستحي/ة بعد بست 😹" 

ws[136] = "😜" 
rs[136] = "ضم لسانك 😁 فضحتنه" 

ws[137] = "😝" 
rs[137] = "غص الولد جيبوله ببسي دايت 😹" 

ws[138] = "😛" 
rs[138] = "هذا مطلع لسانه كيوت 😹" 

ws[139] = "😐" 
rs[139] = "عجوز في صدمه 😹☝🏿️" 

ws[140] = "🤐" 
rs[140] = "عفيه لو هيج تخيط حلكك لو لا 😹😹" 

ws[141] = "حاته" 
rs[141] = "وينها خلي نرقمها 😍😹" 

ws[142] = "حاتة" 
rs[142] = "وينها خلي نرقمها 😍😹" 

ws[143] = "صاك" 
rs[143] = "وينه خلي اشمر عليه طماطه 😹😍" 

ws[144] = "صاكة" 
rs[144] = "وينها خلي اكفش شعرها 😹😍" 

ws[145] = "حات" 
rs[145] = "😒وين اكو هيج مصطلح" 

ws[146] = "سرسر" 
rs[146] = " ها لوكي😠اشرايد اشكد لوكي هذا😅بطلو زحف كدام البنات نافخ روحه 😴وهوه جنه طلي ياله ولي 😅😆" 

ws[147] = "🤔🤔" 
rs[147] = "على كيفك انشتاين 😹🤘🏿" 

ws[148] = "☹️" 
rs[148] = "لاتحزن 🙁❤️ ف الله معك" 

ws[149] = "ايتاشي" 
rs[149] = "ها يمعود شكو خير والله دخت 😞" 

ws[150] = "ايتا" 
rs[150] = "‎ها شكو خير ارحمو بحالي شويه 😢" 

ws[151] = "سورس" 
rs[151] = "ITACHI V1 " 

ws[152] = "منو هاي" 
rs[152] = "هَـ (⊙﹏⊙) ــاآي😝الراقصه مال الكروب💃😂" 

ws[153] = "اتفل" 
rs[153] = "‏​‏​​​​​​‏​تـ💦😙ـف ‏​تِـٌ😙💦💦ـفين ‏​ثلاث تـ😗💦💦💦ـ فات‏​​​​ ‏​تف😙ــٌّوُفه ذغِيرَونهٌ ٌ 🌚💦 💦💦💦🌪💨💨💧💦🌊💦💦💦💦🌊💦💦🌊💦💦 اسـ.ــ..ــــــــحب اقسام خخخخخ تفوووو 💦💦💦💦💦💦💦💦💦💦💦💦💦💦💦🌊🌊💦💦🌊🌪💨💨🌪🌪🌊💦💧💦 خـٌٌـٌٌلُـِـِِ😁ــِِـِـُصُ عتاد😹🖐" 

ws[154] = "خالتك" 
rs[154] = "اطيك ربع دينار ونطيني خالتك 🙊😹" 

ws[155] = "حمه" 
rs[155] = "‎🚒🚒🚒 وينه هذا الحمه وينه ع سريع خلي اطفيه 💦" 

ws[156] = "يا سورس هذا" 
rs[156] = "ITACHI V1" 

ws[157] = "😏" 
rs[157] = "اشبيك😒عاوج حلكك😒عبالك واحد 😂ريحك من😒الحلبجه😹" 

ws[158] = "بوت"
rs[158] = "شنو هيه كلساع بوت وبوت اشتغل عد الخلفوك اني ☹️💔"
rs[158] = "ها حبيبي أمر امر 😻❤️"
rs[158] = "هااااا يمعود مو كافي والله دوختني ☹️💔"
    
— the main function 
function run( msg, matches ) 
 — just a local variables that i used in my algorithm 
 local i = 0; local w = false 

 — the main part that get the message that the user send and check if it equals to one of the words in the ws table 🙂 
 — this section loops through all the words table and assign { k } to the word index and { v } to the word itself 
 for k,v in pairs(ws) do 
  — change the message text to uppercase and the { v } value that toke form the { ws } table and than compare it in a specific pattern 
  if ( string.find(string.upper(msg.text), "^" .. string.upper(v) .. "$") ) then 
   — assign the { i } to the index of the reply and the { w } to true ( we will use it later ) 
   i = k; w = true; 
  end 
 end 

 — check if { w } is not false and { i } not equals to 0 
 if ( (w ~= false) and (i ~= 0) ) then 
  — get the receiver :3 
  R = get_receiver(msg) 
  — send him the proper message from the index that { i } assigned to 
  —send_large_msg ( R , rs[i] ); 
  —send_reply(msg.id, rs[i]) 
  reply_msg(msg.id, rs[i], ok_cb, false ) 
 end 
 — don't edit this section 
 if ( msg.text == "about" ) then 
  if ( msg.from.username == "Mouamle" ) then 
   R = get_receiver(msg) 
   send_large_msg ( R , "Made by @Mouamle" ); 
  end 
 end 

end 

return { 
 patterns = { 
  "(.*)" 
   }, 
   run = run 
} 

end
