--[[
 
 
]]

do

local function run(msg, matches)
if is_sudo(msg) and matches[1]== "م مطور" then
return [[

✅الاوامر الخاصه للمطور✅
➖🔵➖🔵➖🔵➖🔵
📛┊تفعيل
📛┊تعطيل
📛┊تفعيل لمدة + الايام
📛┊المدة المتبقية
📛┊سوبر + تحويل خارقة
📛┊ارفع مدير ( معرف - رد )
📛┊حظر عام ( معرف - رد )
📛┊الغاء العام ( ايدي )
📛┊ المحظورين عام
📛┊معلومات المجموعة
📛┊اذاعة ( لرسال رساله لجميع الكروبات )
📛┊غادر ( لمغادرة البوت )
📛┊جلب ملف + الاسم
📛┊ دخول + رابط المجموعه
📛┊رسالة + الايدي + الرسالة
📛┊وضع صوره للبوت
📛┊جهات الاتصال ( لجلب الجهات )
📛┊اضافة جهة اتصال + الجهة
📛┊حذف جهة الاتصال + الجهة
➖🔵➖🔵➖🔵➖🔵➖🔵➖🔵➖
📛┊للتحدث مع مطور البوت 👇🏿
@lll56
⛔️┊واذا جنت محظور تواصل عبر بوت التواصل 👇🏿
@itachitwsl_bot
✳️┊القناة الخاصه في البوت 👇🏿
ِ@ITACHIBOT1
]]
end

if not is_sudo(msg) then
return " لاتلعب ولك بس مطورين البوت لهم الحق بذلك 😐⛔️"
end

end
return {
description = "Help list", 
usage = "Help list",
patterns = {
"(م مطور)"
},
run = run 
}
end
